[Strings]
app_title=YaToML
col_key=Schlüssel
col_type=Typ
col_value=Wert
column_label=Spalte
document_label=Dokument
err_cannot_open_file=Datei konnte nicht geöffnet werden.
err_cannot_open_for_write=Datei konnte nicht zum Schreiben geöffnet werden.
err_display_internal=Interner Fehler beim Anzeigen der Datei:
err_display_unknown=Unbekannter interner Fehler beim Anzeigen der Datei.
err_incomplete_write=Datei konnte nicht vollständig geschrieben werden.
err_save_aborted_verification=Speichern abgebrochen: Sicherheitsprüfung fehlgeschlagen. Die Datei wurde NICHT verändert.
err_unexpected_internal=Unerwarteter interner Fehler: 
err_unknown_parse=Unbekannter interner Fehler beim Parsen.
kind_alias=Alias
kind_bool=Bool
kind_datetime=Datum/Zeit
kind_float=Float
kind_integer=Integer
kind_list=Liste
kind_map=Map
kind_null=Null
kind_string=String
line_label=Zeile
menu_collapse_all=Alle zuklappen
menu_copy_key=Schlüssel kopieren
menu_copy_value=Wert kopieren
menu_edit_value=Bearbeiten	F2
menu_expand_all=Alle aufklappen
menu_navigate=Zum Baum-Knoten springen
menu_save=Speichern	Strg+S
msg_parse_error_cannot_save=Diese Datei hat einen Parse-Fehler und kann nicht gespeichert werden.
msg_saved_with_hints=Gespeichert, aber mit Hinweisen:
parse_error_label=Parse-Fehler
preview_alias_prefix=[Alias -> 
preview_list=[Liste]
preview_map=[Map]
save_failed_suffix=Speichern fehlgeschlagen
status_unsaved=Ungespeicherte Änderungen
verify_structure_child_count=Strukturabweichung nach dem Patchen (Kinderanzahl).
verify_structure_doc_count=Strukturabweichung nach dem Patchen (Dokumentenanzahl).
verify_structure_node_type=Strukturabweichung nach dem Patchen (Knotentyp).
verify_unexpected_change=Ein nicht editierter Wert hat sich unerwartet verändert.
verify_value_mismatch=Ein gespeicherter Wert weicht vom erwarteten neuen Wert ab.
warn_block_scalar=Ein mehrzeiliger Block-Wert (|/>) wurde NICHT gespeichert (für diesen Fall noch nicht unterstützt).
warn_could_not_locate=Ein geänderter Wert konnte nicht sicher lokalisiert werden und wurde NICHT gespeichert.
warn_flow_container=Ein Wert innerhalb einer Flow-Struktur ([...]/{...}) wurde NICHT gespeichert (für diesen Fall noch nicht unterstützt).
warn_internal_position_error=Interner Positionsfehler bei einem geänderten Wert -- NICHT gespeichert.
warn_invalid_datetime_prefix=Ungültiger Datumswert '
warn_invalid_datetime_suffix=' wurde NICHT gespeichert (Originalwert beibehalten).
warn_no_position=Ein geänderter Wert ohne bekannte Position wurde NICHT gespeichert.
warn_unexpected_value=Ein unerwarteter Wert wurde NICHT gespeichert (Originalwert beibehalten).
warn_verify_failed_prefix=Sicherheitsprüfung fehlgeschlagen (
warn_verify_failed_suffix=) -- NICHTS wurde gespeichert.
warn_verify_nothing_saved=NICHTS wurde gespeichert.
warn_verify_original_unparsable=Original nicht reparsierbar
warn_verify_unparsable=Sicherheitsprüfung fehlgeschlagen (Ergebnis nicht mehr parsbar) -- 
